NO_HAVE_LESSONS = "🎉 Пар нет!"
FINISH_LESSONS = "🏁 Пары на сегодня закончились"
LESSON_NOT_STARTED = "🔜 Ваши пары ещё не начались"
BEFORE_STARTS = "➡️ До начала {} пары: {}"  # Номер пары, время
RIGHT_NOW = "⏳ В данный момент идёт {} пара"  # Номер пары
UNTIL_END = "🕰 До конца пары: {}"  # Время
BREAK_BETWEEN_LESSONS = "🕗 Перерыв между {} и {} парой"  # Номер пары, Номер пары

MAIN_MESSAGE = "📄 Расписание для {}{} ({}, {})"  # Группа/препод, на сегодня, день недели, дата
CALLS_HEAD_MESSAGE = "🔔 Расписание звонков:"
START_STOP_TIME = "⌚️ {}-{}"  # час:минуты , час:минуты
LIST_WEEK_DAYS = "📓 Выберите нужный день {} недели"
MENU_MESSAGE = "📓 Выберите один из пунктов"

WINDOW = "(окно)"
NEVER_LESSON = "—"
GROUP_SMILE = "👥"
TEACHER_SMILE = "👨‍🏫"
CLOSE_SMILE = "❌"
RIGHT_SMILE = "➡️"
LEFT_SMILE = "⬅️"
RELOAD_SMILE = "🔄"
SUCCESS_SMILE = "✅"

SHOW_RASP = "✒️ Вы хотите получать расписание - {} ?"
SHOW_CHOOSE = "📓 Выберите какое расписание"
CHOOSE_TEACHER = "👨‍🏫 Выберите нужного преподавателя:"
CHOOSE_GROUP = "👥 Выберите нужную группу:"
CHOOSE_HELP = "\n(Всегда можно ввести текстом)"

UNKNOWN_GROUP_STATUS = ("❓ В данный момент мне не известна ваша группа"
                        "\n🔴 Пожалуйста, введите её в отдельном сообщении"
                        "\n🖊 Примеры: 10А, 11Г, Иванов")
IDONT_UNDERSTAND_GROUP = "❓ Не удалось понять из какой вы группы\n👥 Возможные группы: "

HELP_MESSAGE_TG = ("📄 Список команд:"
                   "\n\nпрепод Фамилия — выведет всех преподавателей с данной фамилией, а также информацию о них"
                   "\n\n🖊 Для тех, кто ошибся в указании своей группы или хочет узнать расписание своего друга из другой группы, "
                   "просто введите нужное название в сообщении"
                   "\n✒️ Чтобы получить расписание преподавателя, введите фамилию,выберите верный вариант в списке и подтвердите выбор кнопкой \"Да\""
                   "\n🕹 Если у вас нет удобной клавиатуры для быстрых запросов расписания, снова введите свою группу"
                   "\n\n🔥 Эксклюзивная функция для телеграмм - получение расписания в ЛЮБОМ диалоге\n"
                   "Для этого введите \"@ Группа/преподаватель\" и появится меню с выбором вашего расписания, или того, что было распознано системой"
                   "\n\n🖍 Менять группу можно сколько угодно раз"
                   "\n🔧 Техническая поддержка "
                   "\n\n🌐 Мы в вк vk.me/")

HELP_MESSAGE_VK = ("📄 Список команд:"
                   "\n\nпрепод Фамилия — выведет всех преподавателей с данной фамилией, а также информацию о них"
                   "\n\n🖊 Для тех, кто ошибся в указании своей группы или хочет узнать расписание своего друга из другой группы, "
                   "просто введите нужное название в сообщении"
                   "\n✒️ Чтобы получить расписание преподавателя, введите фамилию, выберите верный вариант в списке и подтвердите выбор кнопкой \"Да\""
                   "\n🕹 Если у вас нет удобной клавиатуры для быстрых запросов расписания, снова введите свою группу"
                   "\n\n🖍 Менять группу можно сколько угодно раз!"
                   "\n🔧 Техническая поддержка "
                   "\n\n✈ Мы в телеграмме t.me/")

CALLS_SPLIT = ("""8:00 - 9:20
                09:30 - 10:50
                11:00 - 12:20
                12:45 - 14:05
                14:15 - 15:35
                15:45 - 17:05
                17:15 - 18:35
                18:40 - 20:00""")

GOOD_SET_RASP = ("✅ Я запомнил ваше расписание - {}\n"
                 "\n📓 Введите Помощь - выведет полезные команды"
                 "\n🕹 Нажмите кнопку \"Расписание\" "
                 "\n🔨 В случае ошибок/предложений просим писать сюда @mrdevil73"
                 "\n🚀 Приятного пользования ботом!")

START_MESSAGE = (f"👋 Добрый день!"
                 "\n👨‍🎓 Для получения расписания вашей группы введите полное название вашей группы, или выберите в клавиатуре"
                 "\n👨‍🏫 Для получения расписания преподавателя введите фамилию, выберите подходящий вариант и подтвердите выбор нажав 'Да' "
                 "\n✏ Примеры ввода: 10А, 11Г, Иванов")

HAVE_LESSONS_ON_SUNDAY = False
LIST_COUNT = 4
